app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "grgg"]]
---
  def create
  	user = User.find_by(name: params[:session][:name])